docs/links/programming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Links - Programming</title>
<!-- 2018-04-25 Wed 14:10 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ben Moon" />
</head>
<body>
<div id="content">
<h1 class="title">Links - Programming</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Bash</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://bash3boilerplate.sh/">BASH3 Boilerplate</a> – Template for writing better Bash scripts
</li>

<li><a href="http://kvz.io/blog/2013/11/21/bash-best-practices/">Best Practices for Writing Bash Scripts</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">JavaScript</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Frameworks, Libraries, and Tools</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="http://backbonejs.org/">Backbone.js</a>
</li>

<li><a href="http://browserify.org/">Browserify</a> - browser-side require() the node.js way
</li>

<li><a href="https://github.com/cujojs/curl">curl.js</a> - small, fast, extensible module loader that handles AMD,
CommonJS Modules/1.1, CSS, HTML/text, and legacy scripts.
</li>

<li><a href="https://mochajs.org/">Mocha</a> - the fun, simple, flexible JavaScript test framework
</li>

<li><a href="http://requirejs.org/">RequireJS</a>
</li>

<li><a href="http://underscorejs.org/">Underscore.js</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Guides and Q&amp;A</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="https://appendto.com/2010/10/how-good-c-habits-can-encourage-bad-javascript-habits-part-1/">How Good C# Habits can Encourage Bad JavaScript Habits Part 1</a>
</li>

<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide">JavaScript Guide</a>
</li>

<li><a href="http://www.adequatelygood.com/JavaScript-Module-Pattern-In-Depth.html">JavaScript Module Pattern: In-Depth</a>
</li>
</ul>
</div>

<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1">Testing</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li><a href="https://bocoup.com/blog/effective-unit-testing-with-amd">Effective Unit Testing with AMD</a>
</li>

<li><a href="https://open.blogs.nytimes.com/2015/01/15/how-to-unit-test-a-requirejs-application/">How to Unit Test a RequireJS Application</a>
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">LaTeX</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://detexify.kirelabs.org">Detexify</a>
</li>

<li><a href="https://oeis.org/wiki/List_of_LaTeX_mathematical_symbols">List of LaTeX mathematical symbols</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Python</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://www.python.org/dev/peps/pep-0008/">PEP 8 &#x2013; Style Guide for Python Code</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Shell</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="https://www.shellscript.sh/">The Shell Scripting Tutorial</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ben Moon</p>
<p class="date">Created: 2018-04-25 Wed 14:10</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
